waybyte/arduino_logicrom/boards.txt
# upload
mc20u.bootloader.tool=logicromflasher
mc20u.upload.tool=logicromflasher
mc20u.upload.protocol=logicromflasher
mc20u.upload.maximum_size=262144
mc20u.upload.maximum_ram_size=96256
mc20u.upload.speed=460800
mc20u.upload.require_upload_port=true
mc20u.upload.wait_for_upload_port=true

# Quectel M56
quectelm56.name=Quectel M56

# build
quectelm56.build.core=logicrom
quectelm56.build.cpu=arm9ejs
quectelm56.build.f_cpu=260000000
quectelm56.build.board=QUECTEL_M56TEA
quectelm56.build.mcu=mt6261
quectelm56.build.variant=mc20u
quectelm56.build.extra_flags=-DPLATFORM_M56=1
quectelm56.build.logicromlib=logicrom
quectelm56.build.ldscript=linkerscript.ld
quectelm56.menu.debug.Release=Release
quectelm56.menu.debug.Release.build.build_type=
quectelm56.menu.debug.Debug=Debug
quectelm56.menu.debug.Debug.build.build_type=_debug
quectelm56.menu.stdio.none=None
quectelm56.menu.stdio.none.build.stdio_port=
quectelm56.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
quectelm56.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
quectelm56.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
quectelm56.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
quectelm56.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
quectelm56.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
quectelm56.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
quectelm56.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
quectelm56.bootloader.tool=logicromflasher
quectelm56.upload.tool=logicromflasher
quectelm56.upload.protocol=logicromflasher
quectelm56.upload.maximum_size=262144
quectelm56.upload.maximum_ram_size=96256
quectelm56.upload.speed=460800
quectelm56.upload.require_upload_port=true
quectelm56.upload.wait_for_upload_port=true

# sim868 board definition
sim868.name=SIMCOM SIM868 GSM Module

# build
sim868.build.core=logicrom
sim868.build.cpu=arm9ejs
sim868.build.f_cpu=260000000
sim868.build.board=SIMCOM_SIM868
sim868.build.mcu=mt2503
sim868.build.variant=sim868
sim868.build.vid=0x0E8D
sim868.build.pid=0x0003
sim868.build.extra_flags=-DPLATFORM_SIM868=1
sim868.build.logicromlib=logicrom
sim868.build.ldscript=linkerscript.ld
sim868.menu.debug.Release=Release
sim868.menu.debug.Release.build.build_type=
sim868.menu.debug.Debug=Debug
sim868.menu.debug.Debug.build.build_type=_debug
sim868.menu.stdio.none=None
sim868.menu.stdio.none.build.stdio_port=
sim868.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
sim868.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
sim868.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
sim868.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
sim868.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
sim868.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
sim868.bootloader.tool=logicromflasher
sim868.upload.tool=logicromflasher
sim868.upload.protocol=logicromflasher
sim868.upload.maximum_size=262144
sim868.upload.maximum_ram_size=96256
sim868.upload.speed=460800
sim868.upload.require_upload_port=true
sim868.upload.wait_for_upload_port=true

## ASR160x Boards
#################

# SIMCOM A7670C Module
a7670.name=SIMCOM A7670C (ASR1601) LTE Cat.1 Module

# build
a7670.build.core=logicrom
a7670.build.cpu=armv7r
a7670.build.f_cpu=416000000
a7670.build.board=A7670C
a7670.build.mcu=asr1601
a7670.build.variant=asr160x
a7670.build.vid=0x2ECC
a7670.build.pid=0x3015
a7670.build.flashsz=16M
a7670.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1601=1 -DPLATFORM_A7670=1
a7670.build.logicromlib=logicromasr
a7670.build.ldscript=linkerscript_asr.ld
a7670.menu.debug.Release=Release
a7670.menu.debug.Release.build.build_type=
a7670.menu.debug.Debug=Debug
a7670.menu.debug.Debug.build.build_type=_debug
a7670.menu.stdio.none=None
a7670.menu.stdio.none.build.stdio_port=
a7670.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
a7670.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
a7670.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
a7670.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
a7670.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
a7670.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
a7670.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
a7670.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
a7670.upload.tool=logicromflasher_asr160x
a7670.upload.protocol=logicromflasher
a7670.upload.maximum_size=1048576
a7670.upload.maximum_ram_size=524288
a7670.upload.speed=460800
a7670.upload.require_upload_port=false
a7670.upload.wait_for_upload_port=false

# Quectel EC100N Module
ec100n.name=Quectel EC100N (ASR1603) LTE Cat.1 Module

# build
ec100n.build.core=logicrom
ec100n.build.cpu=armv7r
ec100n.build.f_cpu=416000000
ec100n.build.board=EC100N
ec100n.build.mcu=asr1603
ec100n.build.variant=asr160x
ec100n.build.vid=0x2ECC
ec100n.build.pid=0x3015
ec100n.build.flashsz=16M
ec100n.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1603=1 -DPLATFORM_EC100N=1
ec100n.build.logicromlib=logicromasr
ec100n.build.ldscript=linkerscript_asr.ld
ec100n.menu.debug.Release=Release
ec100n.menu.debug.Release.build.build_type=
ec100n.menu.debug.Debug=Debug
ec100n.menu.debug.Debug.build.build_type=_debug
ec100n.menu.stdio.none=None
ec100n.menu.stdio.none.build.stdio_port=
ec100n.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec100n.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec100n.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec100n.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec100n.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec100n.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec100n.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
ec100n.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
ec100n.upload.tool=logicromflasher_asr160x
ec100n.upload.protocol=logicromflasher
ec100n.upload.maximum_size=1048576
ec100n.upload.maximum_ram_size=524288
ec100n.upload.speed=460800
ec100n.upload.require_upload_port=false
ec100n.upload.wait_for_upload_port=false

# Quectel EC100S Module
ec100s.name=Quectel EC100S (ASR1601) LTE Cat.1 Module

# build
ec100s.build.core=logicrom
ec100s.build.cpu=armv7r
ec100s.build.f_cpu=416000000
ec100s.build.board=EC100S
ec100s.build.mcu=asr1601
ec100s.build.variant=asr160x
ec100s.build.vid=0x2ECC
ec100s.build.pid=0x3015
ec100s.build.flashsz=16M
ec100s.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1601=1 -DPLATFORM_EC100S=1
ec100s.build.logicromlib=logicromasr
ec100s.build.ldscript=linkerscript_asr.ld
ec100s.menu.debug.Release=Release
ec100s.menu.debug.Release.build.build_type=
ec100s.menu.debug.Debug=Debug
ec100s.menu.debug.Debug.build.build_type=_debug
ec100s.menu.stdio.none=None
ec100s.menu.stdio.none.build.stdio_port=
ec100s.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec100s.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec100s.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec100s.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec100s.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec100s.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec100s.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
ec100s.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

