waybyte/arduino_logicrom/boards.txt
# upload
ec600s.upload.tool=logicromflasher_asr160x
ec600s.upload.protocol=logicromflasher
ec600s.upload.maximum_size=1048576
ec600s.upload.maximum_ram_size=524288
ec600s.upload.speed=460800
ec600s.upload.require_upload_port=false
ec600s.upload.wait_for_upload_port=false

# Quectel EG912Y Module definition
eg912y.name=Quectel EG912Y (ASR1603) LTE Cat.1 Module

# build
eg912y.build.core=logicrom
eg912y.build.cpu=armv7r
eg912y.build.f_cpu=416000000
eg912y.build.board=EG912Y
eg912y.build.mcu=asr1603
eg912y.build.variant=asr160x
eg912y.build.vid=0x2ECC
eg912y.build.pid=0x3015
eg912y.build.flashsz=8M
eg912y.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1603=1 -DPLATFORM_EG912Y=1
eg912y.build.logicromlib=logicromasr
eg912y.build.ldscript=linkerscript_asr.ld
eg912y.menu.debug.Release=Release
eg912y.menu.debug.Release.build.build_type=
eg912y.menu.debug.Debug=Debug
eg912y.menu.debug.Debug.build.build_type=_debug
eg912y.menu.stdio.none=None
eg912y.menu.stdio.none.build.stdio_port=
eg912y.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
eg912y.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
eg912y.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
eg912y.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
eg912y.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
eg912y.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
eg912y.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
eg912y.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
eg912y.upload.tool=logicromflasher_asr160x
eg912y.upload.protocol=logicromflasher
eg912y.upload.maximum_size=524288
eg912y.upload.maximum_ram_size=524288
eg912y.upload.speed=460800
eg912y.upload.require_upload_port=false
eg912y.upload.wait_for_upload_port=false

# Quectel EG915N Module definition
eg915n.name=Quectel EG915N (ASR1603) LTE Cat.1 Module

# build
eg915n.build.core=logicrom
eg915n.build.cpu=armv7r
eg915n.build.f_cpu=416000000
eg915n.build.board=EG915N
eg915n.build.mcu=asr1603
eg915n.build.variant=asr160x
eg915n.build.vid=0x2ECC
eg915n.build.pid=0x3015
eg915n.build.flashsz=16M
eg915n.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1603=1 -DPLATFORM_EG915N=1
eg915n.build.logicromlib=logicromasr
eg915n.build.ldscript=linkerscript_asr.ld
eg915n.menu.debug.Release=Release
eg915n.menu.debug.Release.build.build_type=
eg915n.menu.debug.Debug=Debug
eg915n.menu.debug.Debug.build.build_type=_debug
eg915n.menu.stdio.none=None
eg915n.menu.stdio.none.build.stdio_port=
eg915n.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
eg915n.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
eg915n.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
eg915n.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
eg915n.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
eg915n.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
eg915n.menu.stdio.ttyusb=USB Uart (/dev/ttyUSB0)
eg915n.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
eg915n.upload.tool=logicromflasher_asr160x
eg915n.upload.protocol=logicromflasher
eg915n.upload.maximum_size=524288
eg915n.upload.maximum_ram_size=524288
eg915n.upload.speed=460800
eg915n.upload.require_upload_port=false
eg915n.upload.wait_for_upload_port=false
